{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit0_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit1_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage1_nonresunit2_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage1_nonresunit2_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit0_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 1], [78, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit1_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage2_nonresunit2_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage2_nonresunit2_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage3_nonresunit0_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage3_nonresunit0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage3_nonresunit1_nonresblock0_convblock1_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 1], [134, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage3_nonresunit1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_batchnormextra0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_batchnormextra0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_batchnormextra0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_batchnormextra0_fwd", 
      "attrs": {
        "axis": "1", 
        "cudnn_off": "False", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 1], [142, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnet0_stage3_nonresunit2_nonresblock0_convblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
